# Uniones

In [1]:
import numpy as np
import pandas as pd

### Ej 2. Cree los 3 DataFrames basados en los siguientes datos sin procesar.

In [2]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Ej 3. Asignalos a cada una de las siguientes variables: data1, data2, data3.

In [3]:
data1 = pd.DataFrame(raw_data_1)

In [4]:
data2 = pd.DataFrame(raw_data_2)

In [5]:
data3 = pd.DataFrame(raw_data_3)

In [6]:
display(data1,data2,data3)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Ej 4. Une los dos primeros dataframes de datos a lo largo de filas y as√≠gnalos a all_data.

In [7]:
all_data = pd.concat([data1,data2], axis=1).reset_index(drop=True)
all_data

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

### Ej 5. Une los dos primeros dataframes de datos a lo largo de las columnas y as√≠gnalos a all_data_col.

### Ej 6. Imprime los valores √∫nicos de data3

In [8]:
data3['subject_id'].unique(), data3['test_id'].unique()

(array(['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'], dtype=object),
 array([51, 15, 61, 16, 14,  1], dtype=int64))

In [9]:
data3.stack().unique()

array(['1', 51, '2', 15, '3', '4', 61, '5', 16, '7', 14, '8', '9', 1,
       '10', '11'], dtype=object)

### Ej 7. Fusionar all_data y data3 por el valor subject_id.

### Ej 8. Fusione solo los datos que tengan el mismo 'subject_id' tanto en data1 como en data2.

In [31]:
pd.merge(data1, data2, on="subject_id", suffixes=["_1","_2"]) #en vez de sufijos, puedo usar how='inner'

  subject_id first_name_1 last_name_1 first_name_2 last_name_2
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

### Ej 9. Fusione todos los valores en datos1 y datos2, con registros coincidentes y registros no coincidentes de ambos lados cuando est√©n disponibles.

In [35]:
pd.merge(data1, data2, on="subject_id", suffixes=["_1","_2"], how="outer", indicator=True)

  subject_id first_name_1 last_name_1 first_name_2 last_name_2      _merge
0          1         Alex    Anderson          NaN         NaN   left_only
1          2          Amy    Ackerman          NaN         NaN   left_only
2          3        Allen         Ali          NaN         NaN   left_only
3          4        Alice        Aoni        Billy      Bonder        both
4          5       Ayoung     Atiches        Brian       Black        both
5          6          NaN         NaN         Bran     Balwner  right_only
6          7          NaN         NaN        Bryce       Brice  right_only
7          8          NaN         NaN        Betty      Btisan  right_only